public class Ex5_9 {

	public static void main(String[] args) {
		
		// 2차원 배열 : 테이블 형태(행열)의 데이터를 저장하기 위한 배열
		// -> 1차원 배열이 여러개 모인것(1차원 배열의 배열)
		
		// int[][] score = new int[4][3]; -> 4행 3열의 2차원 배열을 생성, 저장공간 12개
		// score[0][0] = 100; -> 배열 score의 1행1열에 100을 저장
		
		// 2차원 배열의 초기화
		// 1. int[][] arr = new int[][]{{1,2,3}, {4,5,6}}; - 참고만하기
		// 2. int[][] arr = {{}1,2,3}, {4,5,6}}; 보기 힘드니 밑에 방식으로 많이씀
		
		// -> int[][] arr = {
		//						{1, 2, 3},
		//						{4, 5, 6}
		//					 };
		
		// 여기서 arr은 참조변수 arr[0],arr[1]을 참조하고 있고
		// arr[0]은 arr[0][0],arr[0][1],arr[0][2]를 참조하는 것과같음
		
		
		
		
		
	}

}
