public class Ex6_1 {

	public static void main(String[] args) {
		 
		// 80년대초 빠른변화를 못쫓아가 소프트웨어에 위기가 찾아옴
		// 기존 프로그래밍언어로 변화를 못쫓아감 -> 객체지향 언어 도입(절차적 -> 객체지향)
		
		// c언어에 객체지향 도입한게 c++, 너무 어려우니까 단점보완 + 좀더쉽게 나온게 1996년 Java
		
		// 객체지향 언어의 좋은점!
		// 객체지향언어는 절차적언어에 비해 코드의 재사용성이 높고
		// 유지보수에 용이하며(변화를 쫓아가는데 좋음) 중복코드를 제거
		
		// 객체지향 언어 = 프로그래밍 언어 + 객체지향개념(규칙)
		// 새로운게 아니라 기본적인 프로그래밍 언어에 객체지향개념을 더한것
		
		// 객체지향 언어의 특징 4가지(핵심개념), OOP(Object Oriented Programming)
		// 캡슐화, 상속, 추상화, 다형성
		
		// 어떻게 공부? 6장 반복한뒤 7장으로 넘어가 다형성까지 반복해서보고 요약 후 외우기.
		// 요약본을 계속 보고 외우며 다음에 추상화, 인터페이스 공부 + 7,8,9강 등등
		// 기초편을 다보고 부족하다면 자바의정석3판(응용) 보기 , 기초편은 최소한의 핵심
		
		// 그 후에 자바에서 끝나지말고 웹에 관심이 있다면 jsp, spring
		// 모바일에 관심있다면 안드로이드 앱 자바로 만들어보기
		
		// 코딩경험이 어느정도 쌓이면 디자인패턴, 객체지향 개념 이론서나 책 보기.
	}

}
